"""
Маппинг категорий и подкатегорий для фильтрации товаров
"""

MAIN_CATEGORIES_WITH_SUBCATEGORIES = {
    'Кроссовки': [
        'Баскетбол',
        'Скейтбординг',
        'Модные кроссовки & Повседневная обувь',
        'Бег',
        'Тренировки',
        'Бутсы',
        'Туристические',
        'Бейсбольные бутсы',
        'Обувь для настольного тенниса'
    ],
    'Обувь': [
        'Ботинки',
        'Балетки',
        'Повседневная обувь',
        'Модная обувь',
        'Сандалии & Шлепанцы',
        'Туфли',
        'Традиционная обувь',
        'Танцевальная обувь'
    ],
    'Одежда': [
        'Худи & Свитшоты',
        'Куртки & Пальто',
        'Свитеры',
        'Топы',
        'Деним',
        'Брюки',
        'Шорты & Юбки',
        'Платья',
        'Комбинезоны & Комплекты',
        'Спортивная одежда',
        'Домашняя одежда & Нижнее белье',
        'Пляжная одежда'
    ],
    'Сумки': [
        'Сумки через плечо',
        'Сумки',
        'Сумки кросс-боди',
        'Рюкзаки',
        'Поясные сумки & Бананки',
        'Клатчи & Наручные кошельки',
        'Даффлы и дорожные сумки',
        'Другие сумки'
    ],
    'Аксессуары': [
        'Ожерелья & Подвески',
        'Кольца',
        'Браслеты',
        'Серьги',
        'Шапки & Кепки',
        'Шарфы & Шали',
        'Перчатки',
        'Очки',
        'Кошельки и картхолдеры',
        'Ремни',
        'Брелоки',
        'Часы',
        'Другие аксессуары'
    ]
}

